Repository: oyeniyiridwan/resume_app
Catalog: lib/l10n/intl_*.arb
Languages: es, fr, sv

source: Hello
es: hola
fr: bonjour
sv: Hej

# resume
source: Resume App
es: Reanudar aplicación
fr: Reprendre l’application
sv: Återuppta app

source: hi,
es: hola,
fr: salut,
sv: Hej,

source: I'm
es: Estoy
fr: Je suis
sv: Jag är

# job
source: mobile developer...
es: Desarrollador móvil...
fr: Développeur mobile...
sv: mobil utvecklare...

# meet
source: Meet me
es: Conóceme
fr: Rencontrez-moi
sv: Möt mig

# about
source: ABOUT ME
es: SOBRE MÍ
fr: À PROPOS DE MOI
sv: OM MIG

# introduction
source: A mobile developer with 2 years of experience in Android and iOS Mobile App Development. Well-versed in Python and Flutter. Passionate about software development, how it provides technical and automated solutions to human problems, and the impact they have on our day-to-day lives.
es: Un desarrollador móvil con 2 años de experiencia en el desarrollo de aplicaciones móviles Android e iOS. Bien versado en Python y Flutter. Apasionado por el desarrollo de software, cómo proporciona soluciones técnicas y automatizadas a los problemas humanos, y el impacto que tienen en nuestra vida cotidiana.
fr: Un développeur mobile avec 2 ans d’expérience dans le développement d’applications mobiles Android et iOS. Bien versé dans Python et Flutter. Passionné par le développement de logiciels, la façon dont il fournit des solutions techniques et automatisées aux problèmes humains, et l’impact qu’ils ont sur notre vie quotidienne.
sv: En mobilutvecklare med 2 års erfarenhet av Android- och iOS-mobilapputveckling. Väl insatt i Python och Flutter. Brinner för mjukvaruutveckling, hur det ger tekniska och automatiserade lösningar på mänskliga problem och vilken inverkan de har på vårt dagliga liv.

source: SKILLS
es: HABILIDADES
fr: COMPÉTENCES
sv: FÄRDIGHETER

# development
source: Mobile Development
es: Desarrollo móvil
fr: Développement mobile
sv: Mobil utveckling

# language
source: Programming Language
es: Lenguaje de programación
fr: Langage de programmation
sv: Programmeringsspråk

# soft
source: Soft Skills
es: Habilidades blandas
fr: Compétences générales
sv: Mjuka färdigheter

# grit
source: Grit & resilience
es: Determinación y resiliencia
fr: Courage et résilience
sv: Grit & motståndskraft

# problem
source: Problem-solving
es: Resolución de problemas
fr: Résolution de problèmes
sv: Problemlösning

# attention
source: Attention to detail / accuracy
es: Atención al detalle / precisión
fr: Souci du détail / précision
sv: Uppmärksamhet på detaljer / noggrannhet

# adapt
source: Adaptability
es: Adaptabilidad
fr: Adaptabilité
sv: Anpassningsförmåga

# priority
source: Prioritization
es: Priorización
fr: Établissement des priorités
sv: Prioritering

# company
source: FOR THE COMPANY
es: PARA LA EMPRESA
fr: POUR L’ENTREPRISE
sv: FÖR FÖRETAGET

# a
source: I bring passion and commitment to my team, focused on ensuring the growth of our clients' businesses, and will do whatever it takes to achieve consistent commercial success.
es: Aporto pasión y compromiso a mi equipo, enfocado en asegurar el crecimiento de los negocios de nuestros clientes, y haré lo que sea necesario para lograr un éxito comercial constante.
fr: J’apporte passion et engagement à mon équipe, axée sur la croissance des entreprises de nos clients, et je ferai tout ce qu’il faut pour atteindre un succès commercial constant.
sv: Jag tar med mig passion och engagemang till mitt team, fokuserat på att säkerställa tillväxten av våra kunders företag och kommer att göra vad som krävs för att uppnå konsekvent kommersiell framgång.

# b
source: I am a fast learner and will start adding value to your business. This means I can start and perform the role as soon as possible. That means you don't have to closely supervise or monitor me.
es: Aprendo rápido y comenzaré a agregar valor a su negocio. Esto significa que puedo comenzar y desempeñar el papel lo antes posible. Eso significa que no tienes que supervisarme o monitorearme de cerca.
fr: J’apprends vite et je vais commencer à ajouter de la valeur à votre entreprise. Cela signifie que je peux commencer et jouer le rôle dès que possible. Cela signifie que vous n’avez pas à me surveiller ou à me surveiller de près.
sv: Jag lär mig snabbt och kommer att börja tillföra värde till ditt företag. Det innebär att jag kan börja och utföra rollen så snart som möjligt. Det betyder att du inte behöver övervaka eller övervaka mig noggrant.

# c
source: I commit to taking personal responsibility for my continued professional development. So my skills are always at the forefront of what's happening in the industry.
es: Me comprometo a asumir la responsabilidad personal de mi continuo desarrollo profesional. Así que mis habilidades siempre están a la vanguardia de lo que está sucediendo en la industria.
fr: Je m’engage à assumer la responsabilité personnelle de mon développement professionnel continu. Mes compétences sont donc toujours à l’avant-garde de ce qui se passe dans l’industrie.
sv: Jag förbinder mig att ta personligt ansvar för min fortsatta professionella utveckling. Så min kompetens ligger alltid i framkant av vad som händer i branschen.

# d
source: If you hire me, I will be loyal to your company and make an immediate and long-term impact as a mobile developer.
es: Si me contratas, seré leal a tu empresa y tendré un impacto inmediato y a largo plazo como desarrollador móvil.
fr: Si vous m’embauchez, je serai fidèle à votre entreprise et aurai un impact immédiat et à long terme en tant que développeur mobile.
sv: Om du anlitar mig kommer jag att vara lojal mot ditt företag och göra en omedelbar och långsiktig inverkan som mobilutvecklare.

source: PORTFOLIO
es: CARTERA
fr: PORTEFEUILLE
sv: PORTFÖLJ

# below
source: Below are descriptions of Apps I worked on:
es: A continuación se muestran las descripciones de las aplicaciones en las que trabajé:
fr: Vous trouverez ci-dessous des descriptions des applications sur lesquelles j’ai travaillé :
sv: Nedan följer beskrivningar av appar som jag arbetade med:

# link
source: Links to my profile on Learning and Assessment platforms:
es: Enlaces a mi perfil en plataformas de Aprendizaje y Evaluación:
fr: Liens vers mon profil sur les plateformes d’apprentissage et d’évaluation :
sv: Länkar till min profil på utbildnings- och utvärderingsplattformar:

# aa
source: A chatting app similar to that of WhatsApp
es: Una aplicación de chat similar a la de WhatsApp
fr: Une application de chat similaire à celle de WhatsApp
sv: En chattapp som liknar WhatsApp

# bb
source: Implemented Signup and Login using Firebase Authentication.
es: Se implementó el registro y el inicio de sesión con Firebase Authentication.
fr: Mise en œuvre de l’inscription et de la connexion à l’aide de l’authentification Firebase.
sv: Implementerad registrering och inloggning med Firebase-autentisering.

# cc
source: Users register before accessing the cool features of the app through their email and password.
es: Los usuarios se registran antes de acceder a las funciones interesantes de la aplicación a través de su correo electrónico y contraseña.
fr: Les utilisateurs s’inscrivent avant d’accéder aux fonctionnalités intéressantes de l’application via leur e-mail et leur mot de passe.
sv: Användare registrerar sig innan de får tillgång till de coola funktionerna i appen via deras e-postadress och lösenord.

# dd
source: Once the user is registered, they are automatically logged in until they log out.
es: Una vez que el usuario está registrado, inicia sesión automáticamente hasta que cierra sesión.
fr: Une fois l’utilisateur enregistré, il est automatiquement connecté jusqu’à ce qu’il se déconnecte.
sv: När användaren är registrerad loggas de automatiskt in tills de loggar ut.

# ee
source: During registration, users are prompted to upload their images or take picture.
es: Durante el registro, se solicita a los usuarios que carguen sus imágenes o tomen fotografías.
fr: Lors de l’inscription, les utilisateurs sont invités à télécharger leurs images ou à prendre des photos.
sv: Under registreringen uppmanas användarna att ladda upp sina bilder eller ta bilder.

# ff
source: Images are stored in firebase Storage while their chats are stored in the Cloud Firestore Database.
es: Las imágenes se almacenan en Firebase Storage mientras que sus chats se almacenan en la base de datos de Cloud Firestore.
fr: Les images sont stockées dans firebase Storage tandis que leurs chats sont stockés dans la base de données Cloud Firestore.
sv: Bilder lagras i Firebase Storage medan deras chattar lagras i Cloud Firestore Database.

# gg
source: Use Flutter widget stream builder in order to fetch users' info in real time.
es: Utilice el generador de flujos de widgets de Flutter para obtener la información de los usuarios en tiempo real.
fr: Utilisez le générateur de flux de widgets Flutter pour récupérer les informations des utilisateurs en temps réel.
sv: Använd Flutter widget stream builder för att hämta användarnas information i realtid.

# hh
source: It's a business app for managing both the ordering and payment of a food product called ponmo.
es: Es una aplicación empresarial para gestionar tanto el pedido como el pago de un producto alimenticio llamado ponmo.
fr: C’est une application professionnelle pour gérer à la fois la commande et le paiement d’un produit alimentaire appelé ponmo.
sv: Det är en affärsapp för att hantera både beställning och betalning av en livsmedelsprodukt som heter ponmo.

# ii
source: It aids in making selling of ponmo easier, faster and digital.
es: Ayuda a hacer que la venta de ponmo sea más fácil, rápida y digital.
fr: Il aide à rendre la vente de ponmo plus facile, plus rapide et numérique.
sv: Det hjälper till att göra försäljningen av ponmo enklare, snabbare och digital.

# abt
source: About Me
es: Acerca de mí
fr: À propos de moi
sv: Om mig

# ski
source: Skills
es: Habilidades
fr: Compétences
sv: Färdigheter

# port
source: Portfolio
es: Cartera
fr: Portefeuille
sv: Portfölj

# comp
source: For Company
es: Para la empresa
fr: Pour l’entreprise
sv: För företag
